app/controllers/scheduleids_controller.rb

SELECT "scheduleids".* FROM "scheduleids"
---
  def index
    @scheduleids = Scheduleid.all

INSERT INTO "scheduleids" ("bus_id", "time", "starting_point", "destination", "bus_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @scheduleid = Scheduleid.new(scheduleid_params)

    if @scheduleid.save

UPDATE "scheduleids" SET "bus_id" = ?, "time" = ?, "starting_point" = ?, "destination" = ?, "bus_type" = ?, "updated_at" = ? WHERE "scheduleids"."id" = ?  [["bus_id", "112"], ["time", "2am"], ["starting_point", "DU"], ["destination", "Saheb Bazar"], ["bus_type", "Female"], ["updated_at", "2017-07-23 13:34:00.860892"], ["id", 1]]
---
  def update
    if @scheduleid.update(scheduleid_params)

SELECT  "scheduleids".* FROM "scheduleids" WHERE "scheduleids"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_scheduleid
      @scheduleid = Scheduleid.find(params[:id])